In [166]:
import pandas as pd

In [167]:
df = pd.read_csv('data/train.csv')

In [168]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [169]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [170]:
friend_dict_list = [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'}
]

In [171]:
df_1 = pd.DataFrame(friend_dict_list)
df_1.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [172]:
df_1=df_1[['name','age','job']]
df_1.head()
# 위에선 제대로 나왔지만, name,age,jog 순서로 출력되는게 보장되진 않기에, 수정해주는 방법임.

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [173]:
from collections import OrderedDict

In [174]:
freind_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [175]:
df_2 = pd.DataFrame.from_dict(freind_ordered_dict)
df_2.head()
# 위의 그냥 DataFrame에서 추가해서 정확하게 column까지 지정해서 생성하고싶다면
# OrderedDict를 사용해주면 됨.

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [176]:
frend_list =[
    ['john',20,'student'],
    ['nate',30,'teacher']
]
column_name = ['name','age','job']

In [177]:
df_3 = pd.DataFrame.from_records(frend_list,columns=column_name)
df_3.head

<bound method NDFrame.head of    name  age      job
0  john   20  student
1  nate   30  teacher>

In [178]:
friends = [
    {'Name':'Jone','Age':20,'Job':'Student'},
    {'Name':'Jenny','Age':30,'Job':None},
    {'Name':'Nate','Age':30,'Job':'Teacher'}
]

In [179]:
df_4 = pd.DataFrame(friends)
df_4=df_4[['Name','Age','Job']]
df_4.head()

    Name  Age      Job
0   Jone   20  Student
1  Jenny   30     None
2   Nate   30  Teacher

In [180]:
df_4.to_csv('friends.csv')
df_4.to_csv('friends_WithoutNone.csv',index=True,header=True,na_rep='-')
# df_4.to_csv('friends.csv',index=True,header=True) 로 기본값 설정돼있음.
df_4.to_csv('friends_NoneIndex.csv',index=False,header=True)
df_4.to_csv('friends_NoneHeaderNIndex.csv',index=False,header=False)

In [181]:
# 사용법 확인 #1


friend_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[25,30,30]),
        ('job',['student','developer','teacher'])
    ]
)
df= pd.DataFrame.from_dict(friend_list)
df

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   30    teacher

In [182]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [183]:
df= df[1:3]
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [184]:
# 사용법 확인 #2

friend_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[25,30,30]),
        ('job',['student','developer','teacher'])
    ]
)
df= pd.DataFrame.from_dict(friend_list)
df

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   30    teacher

In [194]:
df.loc[[0,2]]
#  loc 은 row(index) 값을 input 하여 그 내용을 Output 으로 가져옴

   name  age      job
0  John   25  student
2  Nate   30  teacher

In [195]:
# 사용법 확인 #3 ----by column condition

friend_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[25,30,30]),
        ('job',['student','developer','teacher'])
    ]
)
df= pd.DataFrame.from_dict(friend_list)
df

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   30    teacher

In [200]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [202]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [205]:
df[(df.age>25)&(df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

In [210]:
# 사용법 확인 #4 ---Filter column By index

friend_list =[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
column_name = ['name','age','job']
df= pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [212]:
df.iloc[:,0:2] #row 는 전부다, column은 0에서 1까지/

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [215]:
#  DATA FILTERING
df = pd.read_csv('data/train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [218]:
df_filtered = df[['Survived','Age']]
df_filtered

     Survived   Age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

In [220]:
df.filter(items=['Survived','Age'])

     Survived   Age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

In [222]:
df.filter(like='e',axis=1) #축 1에 있는(axis=1) e가 들어간 모든 정보를 filter(like='e')

,PassengerId,Survived,Name,Sex,Age,Ticket,Fare,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S
4,5,0,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S
...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,S
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C
890,891,0,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,Q

In [223]:
df.filter(regex='d$',axis=1) #정규식을 사용해서 d로 끝나는것만 필터링 하고싶어(regex='d$') 1번째 축에서(axis=1)

     PassengerId  Survived Embarked
0              1         0        S
1              2         1        C
2              3         1        S
3              4         1        S
4              5         0        S
..           ...       ...      ...
886          887         0        S
887          888         1        S
888          889         0        S
889          890         1        C
890          891         0        Q

[891 rows x 3 columns]